faster-regex-search.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-12-04 Sun 23:23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Faster Regex Search</title>
<meta name="author" content="David Lukeš" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<span id="lights" onclick="darkModeToggle()"><svg fill="none" viewBox="0 0 24 24" width="24" height="24" stroke="currentColor"><path stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M12 3v1m0 16v1m9-9h-1M4 12H3m15.364 6.364l-.707-.707M6.343 6.343l-.707-.707m12.728 0l-.707.707M6.343 17.657l-.707.707M16 12a4 4 0 11-8 0 4 4 0 018 0z"></path></svg></span>
</div>
<div id="content" class="content">
<h1 class="title">Faster Regex Search</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb09ad99">1. Task</a></li>
<li><a href="#org1f46150">2. Possible approaches</a>
<ul>
<li><a href="#orgb19b351">2.1. Match list of regexes in nested for-loop</a></li>
<li><a href="#org205eb19">2.2. Build a union with named groups</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb09ad99" class="outline-2">
<h2 id="orgb09ad99"><span class="section-number-2">1.</span> <a href="#orgb09ad99">Task</a></h2>
<div class="outline-text-2" id="text-1">
<p>
Starting with a list of regexes and a list of tokens, try to match each of the regexes and store the first regex which matches, if any.
</p>

<p>
Note: we want to store the regexes, not the strings that matched. This makes it non-trivial. If we just build a straightforward union regex out of the list of regexes, we won&rsquo;t know which part matched.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #51afef;">import</span> regex <span style="color: #51afef;">as</span> re</code>
<code><span style="color: #51afef;">from</span> nltk.book <span style="color: #51afef;">import</span> <span style="color: #51afef;">*</span></code>
<code></code>
<code><span style="color: #dcaeea;">regexes</span> <span style="color: #51afef;">=</span> [<span style="color: #98be65;">r"(?i:elinor.*)"</span>, <span style="color: #98be65;">r"(?i:marianne.*)"</span>,</code>
<code>           <span style="color: #98be65;">r"(?i:edward.*)"</span>, <span style="color: #98be65;">r"(?i:willoughby.*)"</span>, <span style="color: #98be65;">r"(?i:colonel.*)"</span>]</code>
<code>text2</code>
</pre>
</div>

<pre class="example">
&lt;Text: Sense and Sensibility by Jane Austen 1811&gt;
</pre>
</div>
</div>

<div id="outline-container-org1f46150" class="outline-2">
<h2 id="org1f46150"><span class="section-number-2">2.</span> <a href="#org1f46150">Possible approaches</a></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb19b351" class="outline-3">
<h3 id="orgb19b351"><span class="section-number-3">2.1.</span> <a href="#orgb19b351">Match list of regexes in nested for-loop</a></h3>
<div class="outline-text-3" id="text-2-1">
<p>
Pros: Straightforward.
</p>

<p>
Cons: Matching a list of regexes in a loop over and over is really slow compared to doing just one regex match per token, especially if the list is long and matches are found only seldom.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #dcaeea;">patterns</span> <span style="color: #51afef;">=</span> [re.<span style="color: #51afef; font-weight: bold; font-style: italic;">compile</span>(r) <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">r</span> <span style="color: #51afef;">in</span> regexes]</code>
<code>patterns</code>
</pre>
</div>

<pre class="example">
[regex.Regex('(?i:elinor.*)', flags=regex.F | regex.V1),
 regex.Regex('(?i:marianne.*)', flags=regex.F | regex.V1),
 regex.Regex('(?i:edward.*)', flags=regex.F | regex.V1),
 regex.Regex('(?i:willoughby.*)', flags=regex.F | regex.V1),
 regex.Regex('(?i:colonel.*)', flags=regex.F | regex.V1)]
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #dcaeea;">results</span> <span style="color: #51afef;">=</span> []</code>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #51afef;">%%</span>timeit</code>
<code><span style="color: #51afef;">for</span> <span style="color: #dcaeea;">token</span> <span style="color: #51afef;">in</span> text2:</code>
<code>    <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">pat</span> <span style="color: #51afef;">in</span> patterns:</code>
<code>        <span style="color: #51afef;">if</span> pat.<span style="color: #51afef; font-weight: bold; font-style: italic;">match</span>(token):</code>
<code>            results.<span style="color: #51afef; font-weight: bold; font-style: italic;">append</span>(pat.<span style="color: #a9a1e1; font-style: italic;">pattern</span>)</code>
<code>            <span style="color: #51afef;">break</span></code>
</pre>
</div>

<pre class="example">
84.4 ms ± 564 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #c678dd; font-weight: bold;">len</span>(results), results[:<span style="color: #a9a1e1;">10</span>]</code>
</pre>
</div>

<pre class="example" id="org20818b1">
<code>(154629,</code>
<code> ['(?i:elinor.*)',</code>
<code>  '(?i:marianne.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:marianne.*)',</code>
<code>  '(?i:edward.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:edward.*)'])</code>
</pre>
</div>
</div>

<div id="outline-container-org205eb19" class="outline-3">
<h3 id="org205eb19"><span class="section-number-3">2.2.</span> <a href="#org205eb19">Build a union with named groups</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Pros: Only one regex match attempt per token.
</p>

<p>
Cons: Implemenation is a bit more involved and therefore error/bug-prone. In theory, group names can clash with group names entered by user. I could use UUIDs to make collisions extremely unlikely, but in practice, I don&rsquo;t think anyone will actually use named groups when entering regexes into this app. Also, the abstraction is a bit more leaky: the user thinks he&rsquo;s entering separate regexes, but since they all end up being concatenated to one, this affects the syntax that can be used: in particular, inline flags like <code>(?i)</code> can only appear at the start of a regular expression, so specifying a query like <code>foo (?i)bar</code> won&rsquo;t work. Still, these are all rather advanced features that even regular users of regular expressions often aren&rsquo;t aware of, so let&rsquo;s trade them for the performance improvement.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #dcaeea;">group2regex</span> <span style="color: #51afef;">=</span> {<span style="color: #98be65;">f"g</span><span style="color: #51afef;">{</span><span style="color: #bbc2cf; background-color: #282c34;">i</span><span style="color: #51afef;">}</span><span style="color: #98be65;">"</span>: r <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">i</span>, <span style="color: #dcaeea;">r</span> <span style="color: #51afef;">in</span> <span style="color: #c678dd; font-weight: bold;">enumerate</span>(regexes)}</code>
<code><span style="color: #dcaeea;">pat</span> <span style="color: #51afef;">=</span> re.<span style="color: #51afef; font-weight: bold; font-style: italic;">compile</span>(<span style="color: #98be65;">"|"</span>.<span style="color: #51afef; font-weight: bold; font-style: italic;">join</span>(<span style="color: #98be65;">f"(?P&lt;</span><span style="color: #51afef;">{</span><span style="color: #bbc2cf; background-color: #282c34;">g</span><span style="color: #51afef;">}</span><span style="color: #98be65;">&gt;</span><span style="color: #51afef;">{</span><span style="color: #bbc2cf; background-color: #282c34;">r</span><span style="color: #51afef;">}</span><span style="color: #98be65;">)"</span> <span style="color: #51afef;">for</span> <span style="color: #dcaeea;">g</span>, <span style="color: #dcaeea;">r</span> <span style="color: #51afef;">in</span> group2regex.<span style="color: #51afef; font-weight: bold; font-style: italic;">items</span>()))</code>
<code>group2regex, pat</code>
</pre>
</div>

<pre class="example">
({'g0': '(?i:elinor.*)',
  'g1': '(?i:marianne.*)',
  'g2': '(?i:edward.*)',
  'g3': '(?i:willoughby.*)',
  'g4': '(?i:colonel.*)'},
 regex.Regex('(?P&lt;g0&gt;(?i:elinor.*))|(?P&lt;g1&gt;(?i:marianne.*))|(?P&lt;g2&gt;(?i:edward.*))|(?P&lt;g3&gt;(?i:willoughby.*))|(?P&lt;g4&gt;(?i:colonel.*))', flags=regex.F | regex.V1))
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #dcaeea;">results</span> <span style="color: #51afef;">=</span> []</code>
<code>pat.<span style="color: #51afef; font-weight: bold; font-style: italic;">match</span>(<span style="color: #98be65;">"Marianne's"</span>)</code>
</pre>
</div>

<pre class="example">
&lt;regex.Match object; span=(0, 10), match="Marianne's"&gt;
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #51afef;">%%</span>timeit</code>
<code><span style="color: #51afef;">for</span> <span style="color: #dcaeea;">token</span> <span style="color: #51afef;">in</span> text2:</code>
<code>    <span style="color: #51afef;">if</span> (<span style="color: #dcaeea;">m</span> := pat.<span style="color: #51afef; font-weight: bold; font-style: italic;">match</span>(token)) <span style="color: #51afef;">is</span> <span style="color: #51afef;">not</span> <span style="color: #c678dd;">None</span>:</code>
<code>        results.<span style="color: #51afef; font-weight: bold; font-style: italic;">append</span>(group2regex[m.<span style="color: #a9a1e1; font-style: italic;">lastgroup</span>])</code>
</pre>
</div>

<pre class="example">
26.7 ms ± 294 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)
</pre>


<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="color: #c678dd; font-weight: bold;">len</span>(results), results[:<span style="color: #a9a1e1;">10</span>]</code>
</pre>
</div>

<pre class="example" id="org781db60">
<code>(154629,</code>
<code> ['(?i:elinor.*)',</code>
<code>  '(?i:marianne.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:marianne.*)',</code>
<code>  '(?i:edward.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:elinor.*)',</code>
<code>  '(?i:edward.*)'])</code>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Lukeš</p>
<p class="date">Created: 2022-12-04 Sun 23:23</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6)</p>
</div>
</body>
</html>
